ShahinFi/seba-robot/firmware/stm32/src/current_sensor/current_sensor.c
#include "current_sensor.h"
#include "current_sensor_diagnostic.h"

#include "stm32g4xx_hal.h"

#include <limits.h>
#include <stddef.h>
#include <stdint.h>

/*
 * Left ACS711:
 *   VOUT  -> PA4 -> ADC2_IN17
 *   FAULT -> PC2
 *
 * Right ACS711:
 *   VOUT  -> PB0 -> ADC1_IN15
 *   FAULT -> PC3
 */

#define CURRENT_SENSOR_ADC_MAX           4095L
#define CURRENT_SENSOR_REFERENCE_MV      3300L
#define CURRENT_SENSOR_SENSITIVITY_MV_A  90L

#define CURRENT_SENSOR_PWM_HZ                 20000U
#define CURRENT_SENSOR_SAMPLES_PER_PWM_PERIOD     4U
#define CURRENT_SENSOR_TIMED_SAMPLE_HZ            \
    (CURRENT_SENSOR_PWM_HZ * CURRENT_SENSOR_SAMPLES_PER_PWM_PERIOD)
#define CURRENT_SENSOR_DMA_BUFFER_SAMPLES        80U
#define CURRENT_SENSOR_DMA_HALF_SAMPLES          \
    (CURRENT_SENSOR_DMA_BUFFER_SAMPLES / 2U)
#define CURRENT_SENSOR_ZERO_SAMPLES             256U
#define CURRENT_SENSOR_ADC_TIMEOUT_MS            10U
#define CURRENT_SENSOR_SETTLE_TIME_MS            20U

/*
 * Positive current follows the same robot-forward wheel torque
 * convention used by the motor and actuator-control modules.
 */
#define LEFT_CURRENT_SIGN   -1L
#define RIGHT_CURRENT_SIGN  -1L

#define LEFT_FAULT_PORT   GPIOC
#define LEFT_FAULT_PIN    GPIO_PIN_2

#define RIGHT_FAULT_PORT  GPIOC
#define RIGHT_FAULT_PIN   GPIO_PIN_3

typedef struct
{
    volatile bool active;
    volatile bool done;
    volatile uint32_t target_count;
    volatile uint32_t sample_count;
    volatile uint64_t adc_total;
    volatile uint16_t minimum_adc;
    volatile uint16_t maximum_adc;
} CurrentSensorCaptureState;

static ADC_HandleTypeDef left_adc;
static ADC_HandleTypeDef right_adc;

static DMA_HandleTypeDef left_dma;
static DMA_HandleTypeDef right_dma;

static uint32_t left_dma_buffer[
    CURRENT_SENSOR_DMA_BUFFER_SAMPLES
];

static uint32_t right_dma_buffer[
    CURRENT_SENSOR_DMA_BUFFER_SAMPLES
];

static uint16_t left_zero_adc;
static uint16_t right_zero_adc;

static volatile uint16_t left_latest_adc;
static volatile uint16_t right_latest_adc;
static volatile int32_t left_latest_current_ma;
static volatile int32_t right_latest_current_ma;
static volatile uint32_t left_filtered_blocks;
static volatile uint32_t right_filtered_blocks;
static volatile bool left_latest_ready;
static volatile bool right_latest_ready;

static CurrentSensorCaptureState left_capture;
static CurrentSensorCaptureState right_capture;

static void CurrentSensor_GPIO_Init(void);
static bool CurrentSensor_DMA_Init(void);
static bool CurrentSensor_Timer_Init(void);

static bool CurrentSensor_ADC1_Init(
    bool timer_triggered,
    bool calibrate
);

static bool CurrentSensor_ADC2_Init(
    bool timer_triggered,
    bool calibrate
);

static bool CurrentSensor_StartTimedSampling(void);

static bool CurrentSensor_ReadAverage(
    ADC_HandleTypeDef *adc,
    uint32_t number_of_samples,
    uint16_t *average
);

static bool CurrentSensor_ReadRawSample(
    ADC_HandleTypeDef *adc,
    uint16_t *raw_adc
);

static bool CurrentSensor_ReadLatest(
    CurrentSensorChannel channel,
    CurrentSensorReading *reading
);

static void CurrentSensor_ProcessSamples(
    CurrentSensorChannel channel,
    const uint32_t *samples,
    uint32_t offset,
    uint32_t count
);

static void CurrentSensor_UpdateCapture(
    CurrentSensorCaptureState *state,
    uint16_t raw_adc
);

static int32_t CurrentSensor_CountsToMilliamps(
    int32_t adc_difference,
    int32_t direction_sign
);

static int32_t CurrentSensor_DivideSignedRounded(
    int64_t numerator,
    uint32_t denominator
);

bool CurrentSensor_Init(void)
{
    CurrentSensor_GPIO_Init();

    __HAL_RCC_ADC12_CLK_ENABLE();

    /*
     * Zero-current offsets are measured with software-triggered
     * conversions before timed DMA sampling takes ownership of
     * the ADC peripherals.
     */
    if (!CurrentSensor_ADC1_Init(
            false,
            true
        ))
    {
        return false;
    }

    if (!CurrentSensor_ADC2_Init(
            false,
            true
        ))
    {
        return false;
    }

    HAL_Delay(CURRENT_SENSOR_SETTLE_TIME_MS);

    if (!CurrentSensor_ReadAverage(
            &left_adc,
            CURRENT_SENSOR_ZERO_SAMPLES,
            &left_zero_adc
        ))
    {
        return false;
    }

    if (!CurrentSensor_ReadAverage(
            &right_adc,
            CURRENT_SENSOR_ZERO_SAMPLES,
            &right_zero_adc
        ))
    {
        return false;
    }

    if (!CurrentSensor_StartTimedSampling())
    {
        return false;
    }

    return true;
}

bool CurrentSensor_ReadLeft(
    CurrentSensorReading *reading
)
{
    return CurrentSensor_ReadLatest(
        CURRENT_SENSOR_LEFT,
        reading
    );
}

bool CurrentSensor_ReadRight(
    CurrentSensorReading *reading
)
{
    return CurrentSensor_ReadLatest(
        CURRENT_SENSOR_RIGHT,
        reading
    );
}

bool CurrentSensor_ReadBoth(
    CurrentSensorReading *left,
    CurrentSensorReading *right
)
{
    if (
        left == NULL ||
        right == NULL
    )
    {
        return false;
    }

    if (!CurrentSensor_ReadLeft(left))
    {
        return false;
    }

    if (!CurrentSensor_ReadRight(right))
    {
        return false;
    }

    return true;
}

bool CurrentSensor_DiagnosticCapture(
    CurrentSensorChannel channel,
    uint32_t sample_count,
    CurrentSensorDiagnosticCapture *capture
)
{
    CurrentSensorCaptureState *state;
    int32_t minimum_adc_current_ma;
    int32_t maximum_adc_current_ma;
    const uint32_t timeout_ms =
        sample_count /
        (CURRENT_SENSOR_TIMED_SAMPLE_HZ / 1000U) +
        100U;

    const uint32_t start_ms =
        HAL_GetTick();

    /*
     * Diagnostic capture is filled by the DMA sample path. The
     * command waits here only until the requested block has been
     * collected or the expected sample time has been exceeded.
     */
    if (
        capture == NULL ||
        sample_count == 0U
    )
    {
        return false;
    }

    if (channel == CURRENT_SENSOR_LEFT)
    {
        state = &left_capture;
    }
    else if (channel == CURRENT_SENSOR_RIGHT)
    {
        state = &right_capture;
    }
    else
    {
        return false;
    }

    __disable_irq();

    state->active = true;
    state->done = false;
    state->target_count = sample_count;
    state->sample_count = 0U;
    state->adc_total = 0ULL;
    state->minimum_adc = UINT16_MAX;
    state->maximum_adc = 0U;

    __enable_irq();

