ShahinFi/seba-robot/firmware/stm32/src/current_sensor/current_sensor.c
    while (!state->done)
    {
        if (
            HAL_GetTick() -
            start_ms >
            timeout_ms
        )
        {
            __disable_irq();
            state->active = false;
            __enable_irq();
            return false;
        }
    }

    __disable_irq();

    capture->sample_count = state->sample_count;
    capture->zero_adc =
        channel == CURRENT_SENSOR_LEFT
            ? left_zero_adc
            : right_zero_adc;

    capture->minimum_adc = state->minimum_adc;
    capture->maximum_adc = state->maximum_adc;

    capture->average_adc =
        (uint16_t)(
            (
                state->adc_total +
                state->sample_count / 2U
            ) /
            state->sample_count
        );

    minimum_adc_current_ma =
        CurrentSensor_CountsToMilliamps(
            (int32_t)capture->minimum_adc -
            (int32_t)capture->zero_adc,
            channel == CURRENT_SENSOR_LEFT
                ? LEFT_CURRENT_SIGN
                : RIGHT_CURRENT_SIGN
        );

    maximum_adc_current_ma =
        CurrentSensor_CountsToMilliamps(
            (int32_t)capture->maximum_adc -
            (int32_t)capture->zero_adc,
            channel == CURRENT_SENSOR_LEFT
                ? LEFT_CURRENT_SIGN
                : RIGHT_CURRENT_SIGN
        );

    if (minimum_adc_current_ma < maximum_adc_current_ma)
    {
        capture->minimum_current_ma =
            minimum_adc_current_ma;

        capture->maximum_current_ma =
            maximum_adc_current_ma;
    }
    else
    {
        capture->minimum_current_ma =
            maximum_adc_current_ma;

        capture->maximum_current_ma =
            minimum_adc_current_ma;
    }

    capture->average_current_ma =
        CurrentSensor_CountsToMilliamps(
            (int32_t)capture->average_adc -
            (int32_t)capture->zero_adc,
            channel == CURRENT_SENSOR_LEFT
                ? LEFT_CURRENT_SIGN
                : RIGHT_CURRENT_SIGN
        );

    __enable_irq();

    if (channel == CURRENT_SENSOR_LEFT)
    {
        capture->fault_active =
            HAL_GPIO_ReadPin(
                LEFT_FAULT_PORT,
                LEFT_FAULT_PIN
            ) == GPIO_PIN_RESET;
    }
    else
    {
        capture->fault_active =
            HAL_GPIO_ReadPin(
                RIGHT_FAULT_PORT,
                RIGHT_FAULT_PIN
            ) == GPIO_PIN_RESET;
    }

    return true;
}

static void CurrentSensor_GPIO_Init(void)
{
    GPIO_InitTypeDef gpio = {0};

    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();

    gpio.Pin = GPIO_PIN_4;
    gpio.Mode = GPIO_MODE_ANALOG;
    gpio.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOA, &gpio);

    gpio.Pin = GPIO_PIN_0;
    gpio.Mode = GPIO_MODE_ANALOG;
    gpio.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOB, &gpio);

    /*
     * ACS711 FAULT outputs are active low.
     */
    gpio.Pin =
        LEFT_FAULT_PIN |
        RIGHT_FAULT_PIN;

    gpio.Mode = GPIO_MODE_INPUT;
    gpio.Pull = GPIO_PULLUP;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOC, &gpio);
}

static bool CurrentSensor_DMA_Init(void)
{
    __HAL_RCC_DMAMUX1_CLK_ENABLE();
    __HAL_RCC_DMA1_CLK_ENABLE();

    /*
     * ADC1 and ADC2 use independent circular DMA channels so the
     * left and right current sensors are sampled from the same
     * timer trigger without blocking the actuator loop.
     */
    right_dma.Instance =
        DMA1_Channel1;

    right_dma.Init.Request =
        DMA_REQUEST_ADC1;

    right_dma.Init.Direction =
        DMA_PERIPH_TO_MEMORY;

    right_dma.Init.PeriphInc =
        DMA_PINC_DISABLE;

    right_dma.Init.MemInc =
        DMA_MINC_ENABLE;

    right_dma.Init.PeriphDataAlignment =
        DMA_PDATAALIGN_WORD;

    right_dma.Init.MemDataAlignment =
        DMA_MDATAALIGN_WORD;

    right_dma.Init.Mode =
        DMA_CIRCULAR;

    right_dma.Init.Priority =
        DMA_PRIORITY_HIGH;

    if (HAL_DMA_Init(&right_dma) != HAL_OK)
    {
        return false;
    }

    __HAL_LINKDMA(
        &right_adc,
        DMA_Handle,
        right_dma
    );

    left_dma.Instance =
        DMA1_Channel2;

    left_dma.Init.Request =
        DMA_REQUEST_ADC2;

    left_dma.Init.Direction =
        DMA_PERIPH_TO_MEMORY;

    left_dma.Init.PeriphInc =
        DMA_PINC_DISABLE;

    left_dma.Init.MemInc =
        DMA_MINC_ENABLE;

    left_dma.Init.PeriphDataAlignment =
        DMA_PDATAALIGN_WORD;

    left_dma.Init.MemDataAlignment =
        DMA_MDATAALIGN_WORD;

    left_dma.Init.Mode =
        DMA_CIRCULAR;

    left_dma.Init.Priority =
        DMA_PRIORITY_HIGH;

    if (HAL_DMA_Init(&left_dma) != HAL_OK)
    {
        return false;
    }

    __HAL_LINKDMA(
        &left_adc,
        DMA_Handle,
        left_dma
    );

    HAL_NVIC_SetPriority(
        DMA1_Channel1_IRQn,
        5U,
        0U
    );

    HAL_NVIC_EnableIRQ(
        DMA1_Channel1_IRQn
    );

    HAL_NVIC_SetPriority(
        DMA1_Channel2_IRQn,
        5U,
        0U
    );

    HAL_NVIC_EnableIRQ(
        DMA1_Channel2_IRQn
    );

    return true;
}

static bool CurrentSensor_Timer_Init(void)
{
    __HAL_RCC_TIM6_CLK_ENABLE();

    TIM6->CR1 = 0U;
    TIM6->CR2 = 0U;
    TIM6->DIER = 0U;
    TIM6->PSC = 0U;
    TIM6->ARR =
        (
            SystemCoreClock /
            CURRENT_SENSOR_TIMED_SAMPLE_HZ
        ) -
        1U;

    /*
     * The sampling rate is four samples per 20 kHz PWM period.
     * Each DMA half-buffer therefore averages 40 samples over
     * ten PWM periods.
     *
     * MMS = 010 makes TIM6 update events drive TRGO.
     */
    TIM6->CR2 =
        2UL << TIM_CR2_MMS_Pos;

    TIM6->EGR =
        TIM_EGR_UG;

    TIM6->CR1 =
        TIM_CR1_CEN;

    return true;
}

static bool CurrentSensor_ADC1_Init(
    bool timer_triggered,
    bool calibrate
)
{
    ADC_ChannelConfTypeDef channel = {0};

    /*
     * ADC1 reads the right ACS711 output. The same initializer
     * supports startup offset measurement and timer-triggered
     * DMA sampling.
     */
    right_adc.Instance = ADC1;

    right_adc.Init.ClockPrescaler =
        ADC_CLOCK_SYNC_PCLK_DIV1;

    right_adc.Init.Resolution =
        ADC_RESOLUTION_12B;

    right_adc.Init.DataAlign =
        ADC_DATAALIGN_RIGHT;

    right_adc.Init.GainCompensation = 0;

    right_adc.Init.ScanConvMode =
        ADC_SCAN_DISABLE;

    right_adc.Init.EOCSelection =
        ADC_EOC_SINGLE_CONV;

    right_adc.Init.LowPowerAutoWait =
        DISABLE;

    right_adc.Init.ContinuousConvMode =
        DISABLE;

    right_adc.Init.NbrOfConversion = 1;

    right_adc.Init.DiscontinuousConvMode =
        DISABLE;

    right_adc.Init.ExternalTrigConv =
        timer_triggered
            ? ADC_EXTERNALTRIG_T6_TRGO
            : ADC_SOFTWARE_START;

    right_adc.Init.ExternalTrigConvEdge =
        timer_triggered
            ? ADC_EXTERNALTRIGCONVEDGE_RISING
            : ADC_EXTERNALTRIGCONVEDGE_NONE;

    right_adc.Init.DMAContinuousRequests =
        timer_triggered
            ? ENABLE
            : DISABLE;

    right_adc.Init.Overrun =
        ADC_OVR_DATA_OVERWRITTEN;

    right_adc.Init.OversamplingMode =
        DISABLE;

    if (HAL_ADC_Init(&right_adc) != HAL_OK)
    {
        return false;
    }

    if (
        calibrate &&
        HAL_ADCEx_Calibration_Start(
            &right_adc,
            ADC_SINGLE_ENDED
        ) != HAL_OK
    )
    {
        return false;
    }

    channel.Channel =
        ADC_CHANNEL_15;

    channel.Rank =
        ADC_REGULAR_RANK_1;

    channel.SamplingTime =
        ADC_SAMPLETIME_47CYCLES_5;

    channel.SingleDiff =
        ADC_SINGLE_ENDED;

