ShahinFi/seba-robot/firmware/stm32/src/current_sensor/current_sensor.c
    channel.OffsetNumber =
        ADC_OFFSET_NONE;

    channel.Offset = 0;

    return HAL_ADC_ConfigChannel(
               &right_adc,
               &channel
           ) == HAL_OK;
}

static bool CurrentSensor_ADC2_Init(
    bool timer_triggered,
    bool calibrate
)
{
    ADC_ChannelConfTypeDef channel = {0};

    /*
     * ADC2 reads the left ACS711 output. It mirrors ADC1 so both
     * current channels have the same conversion timing.
     */
    left_adc.Instance = ADC2;

    left_adc.Init.ClockPrescaler =
        ADC_CLOCK_SYNC_PCLK_DIV1;

    left_adc.Init.Resolution =
        ADC_RESOLUTION_12B;

    left_adc.Init.DataAlign =
        ADC_DATAALIGN_RIGHT;

    left_adc.Init.GainCompensation = 0;

    left_adc.Init.ScanConvMode =
        ADC_SCAN_DISABLE;

    left_adc.Init.EOCSelection =
        ADC_EOC_SINGLE_CONV;

    left_adc.Init.LowPowerAutoWait =
        DISABLE;

    left_adc.Init.ContinuousConvMode =
        DISABLE;

    left_adc.Init.NbrOfConversion = 1;

    left_adc.Init.DiscontinuousConvMode =
        DISABLE;

    left_adc.Init.ExternalTrigConv =
        timer_triggered
            ? ADC_EXTERNALTRIG_T6_TRGO
            : ADC_SOFTWARE_START;

    left_adc.Init.ExternalTrigConvEdge =
        timer_triggered
            ? ADC_EXTERNALTRIGCONVEDGE_RISING
            : ADC_EXTERNALTRIGCONVEDGE_NONE;

    left_adc.Init.DMAContinuousRequests =
        timer_triggered
            ? ENABLE
            : DISABLE;

    left_adc.Init.Overrun =
        ADC_OVR_DATA_OVERWRITTEN;

    left_adc.Init.OversamplingMode =
        DISABLE;

    if (HAL_ADC_Init(&left_adc) != HAL_OK)
    {
        return false;
    }

    if (
        calibrate &&
        HAL_ADCEx_Calibration_Start(
            &left_adc,
            ADC_SINGLE_ENDED
        ) != HAL_OK
    )
    {
        return false;
    }

    channel.Channel =
        ADC_CHANNEL_17;

    channel.Rank =
        ADC_REGULAR_RANK_1;

    channel.SamplingTime =
        ADC_SAMPLETIME_47CYCLES_5;

    channel.SingleDiff =
        ADC_SINGLE_ENDED;

    channel.OffsetNumber =
        ADC_OFFSET_NONE;

    channel.Offset = 0;

    return HAL_ADC_ConfigChannel(
               &left_adc,
               &channel
           ) == HAL_OK;
}

static bool CurrentSensor_StartTimedSampling(void)
{
    left_latest_ready = false;
    right_latest_ready = false;
    left_filtered_blocks = 0U;
    right_filtered_blocks = 0U;

    left_capture.active = false;
    left_capture.done = false;
    right_capture.active = false;
    right_capture.done = false;

    if (!CurrentSensor_DMA_Init())
    {
        return false;
    }

    /*
     * Reinitialize both ADCs for TIM6-triggered circular DMA
     * after the startup zero-offset measurement is complete.
     */
    if (!CurrentSensor_ADC1_Init(
            true,
            false
        ))
    {
        return false;
    }

    if (!CurrentSensor_ADC2_Init(
            true,
            false
        ))
    {
        return false;
    }

    if (HAL_ADC_Start_DMA(
            &right_adc,
            right_dma_buffer,
            CURRENT_SENSOR_DMA_BUFFER_SAMPLES
        ) != HAL_OK)
    {
        return false;
    }

    if (HAL_ADC_Start_DMA(
            &left_adc,
            left_dma_buffer,
            CURRENT_SENSOR_DMA_BUFFER_SAMPLES
        ) != HAL_OK)
    {
        return false;
    }

    if (!CurrentSensor_Timer_Init())
    {
        return false;
    }

    /*
     * Do not report the current sensor initialized until both
     * DMA paths have produced at least one filtered block.
     */
    const uint32_t start_ms =
        HAL_GetTick();

    while (
        !left_latest_ready ||
        !right_latest_ready
    )
    {
        if (
            HAL_GetTick() -
            start_ms >
            CURRENT_SENSOR_ADC_TIMEOUT_MS
        )
        {
            return false;
        }
    }

    return true;
}

static bool CurrentSensor_ReadAverage(
    ADC_HandleTypeDef *adc,
    uint32_t number_of_samples,
    uint16_t *average
)
{
    uint32_t total = 0U;

    if (
        adc == NULL ||
        average == NULL ||
        number_of_samples == 0U
    )
    {
        return false;
    }

    for (
        uint32_t sample = 0U;
        sample < number_of_samples;
        sample++
    )
    {
        uint16_t raw_adc;

        if (!CurrentSensor_ReadRawSample(
                adc,
                &raw_adc
            ))
        {
            return false;
        }

        total += raw_adc;
    }

    *average =
        (uint16_t)(
            (
                total +
                number_of_samples / 2U
            ) /
            number_of_samples
        );

    return true;
}

static bool CurrentSensor_ReadRawSample(
    ADC_HandleTypeDef *adc,
    uint16_t *raw_adc
)
{
    if (
        adc == NULL ||
        raw_adc == NULL
    )
    {
        return false;
    }

    if (HAL_ADC_Start(adc) != HAL_OK)
    {
        return false;
    }

    if (HAL_ADC_PollForConversion(
            adc,
            CURRENT_SENSOR_ADC_TIMEOUT_MS
        ) != HAL_OK)
    {
        HAL_ADC_Stop(adc);
        return false;
    }

    *raw_adc =
        (uint16_t)HAL_ADC_GetValue(adc);

    return HAL_ADC_Stop(adc) == HAL_OK;
}

static bool CurrentSensor_ReadLatest(
    CurrentSensorChannel channel,
    CurrentSensorReading *reading
)
{
    if (reading == NULL)
    {
        return false;
    }

    /*
     * Latest ADC/current values are written from DMA callbacks.
     * Copy them with interrupts masked, then read the GPIO fault
     * pins outside the critical section.
     */
    __disable_irq();

    if (channel == CURRENT_SENSOR_LEFT)
    {
        if (!left_latest_ready)
        {
            __enable_irq();
            return false;
        }

        reading->raw_adc = left_latest_adc;
        reading->zero_adc = left_zero_adc;
        reading->current_ma = left_latest_current_ma;
    }
    else if (channel == CURRENT_SENSOR_RIGHT)
    {
        if (!right_latest_ready)
        {
            __enable_irq();
            return false;
        }

