ShahinFi/seba-robot/firmware/stm32/src/current_sensor/current_sensor.c
        reading->raw_adc = right_latest_adc;
        reading->zero_adc = right_zero_adc;
        reading->current_ma = right_latest_current_ma;
    }
    else
    {
        __enable_irq();
        return false;
    }

    __enable_irq();

    if (channel == CURRENT_SENSOR_LEFT)
    {
        reading->fault_active =
            HAL_GPIO_ReadPin(
                LEFT_FAULT_PORT,
                LEFT_FAULT_PIN
            ) == GPIO_PIN_RESET;
    }
    else
    {
        reading->fault_active =
            HAL_GPIO_ReadPin(
                RIGHT_FAULT_PORT,
                RIGHT_FAULT_PIN
            ) == GPIO_PIN_RESET;
    }

    return true;
}

static void CurrentSensor_ProcessSamples(
    CurrentSensorChannel channel,
    const uint32_t *samples,
    uint32_t offset,
    uint32_t count
)
{
    uint64_t adc_total = 0ULL;
    uint16_t average_adc;
    CurrentSensorCaptureState *capture;

    if (channel == CURRENT_SENSOR_LEFT)
    {
        capture = &left_capture;
    }
    else
    {
        capture = &right_capture;
    }

    /*
     * DMA callbacks process only the completed half-buffer. The
     * actuator loop then reads the latest averaged block instead
     * of raw PWM-ripple samples.
     */
    for (
        uint32_t index = 0U;
        index < count;
        index++
    )
    {
        const uint16_t raw_adc =
            (uint16_t)(
                samples[offset + index] &
                0xFFFFU
            );

        adc_total += raw_adc;

        CurrentSensor_UpdateCapture(
            capture,
            raw_adc
        );
    }

    average_adc =
        (uint16_t)(
            (
                adc_total +
                count / 2U
            ) /
            count
        );

    if (channel == CURRENT_SENSOR_LEFT)
    {
        left_latest_adc = average_adc;
        left_latest_current_ma =
            CurrentSensor_CountsToMilliamps(
                (int32_t)average_adc -
                (int32_t)left_zero_adc,
                LEFT_CURRENT_SIGN
            );

        left_filtered_blocks++;
        left_latest_ready = true;
    }
    else
    {
        right_latest_adc = average_adc;
        right_latest_current_ma =
            CurrentSensor_CountsToMilliamps(
                (int32_t)average_adc -
                (int32_t)right_zero_adc,
                RIGHT_CURRENT_SIGN
            );

        right_filtered_blocks++;
        right_latest_ready = true;
    }
}

static void CurrentSensor_UpdateCapture(
    CurrentSensorCaptureState *state,
    uint16_t raw_adc
)
{
    if (
        !state->active ||
        state->done
    )
    {
        return;
    }

    if (raw_adc < state->minimum_adc)
    {
        state->minimum_adc = raw_adc;
    }

    if (raw_adc > state->maximum_adc)
    {
        state->maximum_adc = raw_adc;
    }

    state->adc_total += raw_adc;
    state->sample_count++;

    if (state->sample_count >= state->target_count)
    {
        state->active = false;
        state->done = true;
    }
}

static int32_t CurrentSensor_CountsToMilliamps(
    int32_t adc_difference,
    int32_t direction_sign
)
{
    /*
     * ACS711 sensitivity is 90 mV/A. The extra 1000 converts
     * amps to milliamps after ADC counts are converted to mV.
     */
    const int64_t numerator =
        (int64_t)adc_difference *
        CURRENT_SENSOR_REFERENCE_MV *
        1000LL *
        direction_sign;

    const int64_t denominator =
        CURRENT_SENSOR_ADC_MAX *
        CURRENT_SENSOR_SENSITIVITY_MV_A;

    return CurrentSensor_DivideSignedRounded(
        numerator,
        (uint32_t)denominator
    );
}

static int32_t CurrentSensor_DivideSignedRounded(
    int64_t numerator,
    uint32_t denominator
)
{
    if (denominator == 0U)
    {
        return 0;
    }

    if (numerator >= 0)
    {
        numerator +=
            (int64_t)denominator / 2LL;
    }
    else
    {
        numerator -=
            (int64_t)denominator / 2LL;
    }

    return (int32_t)(
        numerator /
        (int64_t)denominator
    );
}

void DMA1_Channel1_IRQHandler(void)
{
    HAL_DMA_IRQHandler(
        &right_dma
    );
}

void DMA1_Channel2_IRQHandler(void)
{
    HAL_DMA_IRQHandler(
        &left_dma
    );
}

void HAL_ADC_ConvHalfCpltCallback(
    ADC_HandleTypeDef *adc
)
{
    if (
        adc != NULL &&
        adc->Instance == ADC1
    )
    {
        CurrentSensor_ProcessSamples(
            CURRENT_SENSOR_RIGHT,
            right_dma_buffer,
            0U,
            CURRENT_SENSOR_DMA_HALF_SAMPLES
        );
    }
    else if (
        adc != NULL &&
        adc->Instance == ADC2
    )
    {
        CurrentSensor_ProcessSamples(
            CURRENT_SENSOR_LEFT,
            left_dma_buffer,
            0U,
            CURRENT_SENSOR_DMA_HALF_SAMPLES
        );
    }
}

void HAL_ADC_ConvCpltCallback(
    ADC_HandleTypeDef *adc
)
{
    if (
        adc != NULL &&
        adc->Instance == ADC1
    )
    {
        CurrentSensor_ProcessSamples(
            CURRENT_SENSOR_RIGHT,
            right_dma_buffer,
            CURRENT_SENSOR_DMA_HALF_SAMPLES,
            CURRENT_SENSOR_DMA_HALF_SAMPLES
        );
    }
    else if (
        adc != NULL &&
        adc->Instance == ADC2
    )
    {
        CurrentSensor_ProcessSamples(
            CURRENT_SENSOR_LEFT,
            left_dma_buffer,
            CURRENT_SENSOR_DMA_HALF_SAMPLES,
            CURRENT_SENSOR_DMA_HALF_SAMPLES
        );
    }
}
